# Rebar Reset Moved Bar Transform Method

Source: https://www.revitapidocs.com/2026/5e2e7166-d294-88a3-5b03-1d38ce930546.htm

---

| Rebar Reset Moved Bar Transform Method |
| --- |

Reset the transformation representing the movement of the bar relative to its default position along the distribution path.
 The moved bar transform will be set to Identity.
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public void ResetMovedBarTransform(
	int barPositionIndex
)
```

```
Public Sub ResetMovedBarTransform (
	barPositionIndex As Integer
)
```

```
public:
void ResetMovedBarTransform(
	int barPositionIndex
)
```

```
member ResetMovedBarTransform :
        barPositionIndex : int -> unit
```

#### Parameters

barPositionIndex Int32
:   The bar index.

Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | barPositionIndex should be in range \[ 0, NumberOfBarPositions\-1 ] and the bar at barPositionIndex should be included. |

See Also

#### Reference

Rebar Class Autodesk.Revit.DB.Structure Namespace